app/controllers/books_controller.rb

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "dddddddddd"], ["created_at", "2021-10-02 12:41:02.805421"], ["updated_at", "2021-10-02 12:41:02.805421"], ["title", "dddd"]]
SELECT "books".* FROM "books"
---
  def create

    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      # ここでindexページ表示に必要なインスタンス変数を果たさなければいけない
      # だが@bookはもう上で定義されている
      # ↓renderをredirect_to indexにしてもエラーは出ないが、ここで得た
      # @bookが空ですよという情報なしでindexアクションを読み込んでしまうので
      # 空欄のエラー表示がされずにindexに飛んでしまう

      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "dd"], ["updated_at", "2021-10-02 13:21:44.958995"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update()